# Handling Missing Data

In [1]:
import pandas as pd

In [2]:
import numpy as np

string_data = pd.Series(['a', 'b', 'c', np.nan, 'e'])

In [3]:
string_data

0      a
1      b
2      c
3    NaN
4      e
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

Built in Python **None** value is also treated as **NA.**

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2    False
3     True
4    False
dtype: bool

## Filtering Out Missing Data

In [7]:
from numpy import nan as NA

`dropna()` returns the Series with only non-null data and index values.

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna(inplace=True)

In [12]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data.notnull()

0    True
2    True
4    True
dtype: bool

Sometimes we need to drop a whole row or a column, that are all NA. we can done this by `dropna()`

In [14]:
data = pd.DataFrame([[1, 2.5, 3], [1, NA, NA], [NA, NA, NA],[NA, 6, 3]], dtype=np.float32)

In [15]:
data

     0    1    2
0  1.0  2.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [16]:
cleaned_data = data.dropna()

In [17]:
data

     0    1    2
0  1.0  2.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [18]:
cleaned_data

     0    1    2
0  1.0  2.5  3.0

If you want to drop only rows then pass `how='all'` in `dropna()`.

In [19]:
data.dropna(how='all')

     0    1    2
0  1.0  2.5  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

To drop columns in the same way, pass axis=1

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  2.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.0  3.0 NaN

In [22]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  2.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

Suppose now you want to keep only rows containing a certain number of observations. We can indicate this with `thresh` argument.

In [23]:
df = pd.DataFrame(np.random.randn(7, 3))

In [24]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0  0.404731       NaN       NaN
1  0.193161       NaN       NaN
2  1.914092       NaN  1.645491
3  0.940074       NaN -0.724866
4 -1.337478  1.693594  0.026610
5  0.712382  0.614429  1.714761
6  0.379758 -0.331290 -0.963136

In [26]:
df.dropna()

          0         1         2
4 -1.337478  1.693594  0.026610
5  0.712382  0.614429  1.714761
6  0.379758 -0.331290 -0.963136

In [27]:
df.dropna(thresh=2)

          0         1         2
2  1.914092       NaN  1.645491
3  0.940074       NaN -0.724866
4 -1.337478  1.693594  0.026610
5  0.712382  0.614429  1.714761
6  0.379758 -0.331290 -0.963136

### Filling in Missing Data

In [28]:
df.fillna(0)

          0         1         2
0  0.404731  0.000000  0.000000
1  0.193161  0.000000  0.000000
2  1.914092  0.000000  1.645491
3  0.940074  0.000000 -0.724866
4 -1.337478  1.693594  0.026610
5  0.712382  0.614429  1.714761
6  0.379758 -0.331290 -0.963136

calling `fillna`with a dict, you can use a different fill value for each column.

In [29]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.404731  0.500000  0.000000
1  0.193161  0.500000  0.000000
2  1.914092  0.500000  1.645491
3  0.940074  0.500000 -0.724866
4 -1.337478  1.693594  0.026610
5  0.712382  0.614429  1.714761
6  0.379758 -0.331290 -0.963136

In [30]:
df = pd.DataFrame(np.random.randn(6, 3))

In [31]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [32]:
df

          0         1         2
0 -0.108524 -0.362555 -0.529777
1 -0.383745  0.416144 -1.097627
2 -0.370823       NaN  1.039004
3 -0.029100       NaN  1.065112
4  0.126529       NaN       NaN
5 -0.669939       NaN       NaN

In [33]:
df.fillna(method='ffill')

          0         1         2
0 -0.108524 -0.362555 -0.529777
1 -0.383745  0.416144 -1.097627
2 -0.370823  0.416144  1.039004
3 -0.029100  0.416144  1.065112
4  0.126529  0.416144  1.065112
5 -0.669939  0.416144  1.065112

In [34]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.108524 -0.362555 -0.529777
1 -0.383745  0.416144 -1.097627
2 -0.370823  0.416144  1.039004
3 -0.029100  0.416144  1.065112
4  0.126529       NaN  1.065112
5 -0.669939       NaN  1.065112

And you can do much more with `fillna()`

In [35]:
data = pd.Series([1, NA, 3.5, NA, 7], dtype=np.float64)

In [36]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

**Removing Duplicates**

In [37]:
data = pd.DataFrame({'k1':['one', 'two']*3+['two'],
                    'k2':[1, 1, 2, 3, 4, 2, 2]})

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   2
6  two   2

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   2

In [41]:
data['k1'].duplicated()

0    False
1    False
2     True
3     True
4     True
5     True
6     True
Name: k1, dtype: bool

In [42]:
data['v1'] = range(7)

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

By default `duplicated` and `drop_duplicated` keep the first observed value combination. Passing `keep='last'` will return the last one.

In [44]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
6  two   2   6

## Transforming Data Using a Function or Mapping

In [45]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon', 
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
meat_from_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [48]:
lowercased = data['food'].str.lower()

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_from_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We could alsohave passed a function that does all the work:

In [52]:
data['food'].map(lambda x: meat_from_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

#### Replacing Values

In [53]:
data = pd.Series([1, -999, 3, -999, 1000, 3], dtype=np.float32)

In [54]:
data

0       1.0
1    -999.0
2       3.0
3    -999.0
4    1000.0
5       3.0
dtype: float32

In [55]:
data.replace(-999, NA)

0       1.0
1       NaN
2       3.0
3       NaN
4    1000.0
5       3.0
dtype: float32

If you want to replace multiple values, the we can do this

In [56]:
data.replace([-999, -1000], NA)

0       1.0
1       NaN
2       3.0
3       NaN
4    1000.0
5       3.0
dtype: float32

We can also pass a dict as an argument

In [57]:
data.replace({-999:NA, -1000:0})

0       1.0
1       NaN
2       3.0
3       NaN
4    1000.0
5       3.0
dtype: float32

# Renaming Axis Indexes

In [58]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [59]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [60]:
transform = lambda x: x.upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [62]:
data.index = data.index.map(transform)

In [63]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

If you want to create a transformed version of a dataset without moidfying the original, then a useful method is`rename`

In [64]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

**rename** can be used in conjuction with a dict like objet providing new values

In [65]:
data.rename(index={'OHIO':'INDIANA'},  columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

## Dicretization and Binning

Suppose you have a data about groupof people in a study, you want them into discrete age buckets.

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

**Let's divide these into bins of 18 to25, 26 to 35, 36 to 60 and finally 61 and older.**

In [67]:
bins = [18, 25, 35, 60, 100]

In [68]:
cats = pd.cut(ages, bins)

In [69]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

So the paranthesis shows that it's an exclusive value and square bracket shows it's an inclusive value.

For making parantesis inclusive we can pass `right=False`

In [72]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [74]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

We can also pass our own bin names by passing a list or array to the `labels` option.

In [75]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [76]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If we pass an integer nulber of bins to `cut` instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data.

In [77]:
data = np.random.rand(20)

In [79]:
# Precision Helps to limit the decimal precision.
pd.cut(data, 4, precision=2)

[(0.51, 0.74], (0.27, 0.51], (0.74, 0.98], (0.74, 0.98], (0.033, 0.27], ..., (0.033, 0.27], (0.27, 0.51], (0.74, 0.98], (0.27, 0.51], (0.033, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.033, 0.27] < (0.27, 0.51] < (0.51, 0.74] < (0.74, 0.98]]

## Detecting and Filtering Outliers

In [80]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [81]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.053934    -0.008912    -0.078130     0.053174
std       0.974074     0.987471     0.976171     0.986847
min      -2.988109    -3.293787    -3.107624    -2.970916
25%      -0.713154    -0.630823    -0.739793    -0.572402
50%      -0.059058    -0.021663    -0.090194     0.094578
75%       0.574363     0.631844     0.569816     0.711730
max       2.810082     3.180981     3.892364     4.134193

In [82]:
data

            0         1         2         3
0   -0.442214  1.119062 -0.248584 -1.143936
1   -0.002185  0.517140 -0.219657  1.101462
2    0.249414 -0.579256 -1.335411  1.114872
3   -0.300953  0.186376 -0.005573 -0.960199
4   -0.453192  0.502439 -0.414468 -0.805293
5    0.423255 -1.421268 -1.415333 -0.835605
6    0.526314  0.174729 -0.317759  0.639917
7   -0.392286 -1.168718 -2.226133  1.993938
8   -1.073737 -1.063939 -0.060118 -1.220886
9    1.645200  0.790127  1.026260 -0.292634
10  -2.402567  0.603688 -0.362202  0.180397
11   0.456058  1.652239  0.021681 -0.551631
12   1.324542  1.696802 -0.652961  0.803265
13   0.057415  0.687661  0.381889  2.054869
14   0.970538 -0.019924 -0.434065  2.441644
15   1.853142 -0.182902 -0.212713 -0.773892
16  -1.586124  0.630897 -0.769305  0.455442
17   0.663231  1.292465 -0.248853 -0.207197
18  -0.818165  0.207241  1.474412 -0.406935
19   0.352831  0.497942 -0.005461  1.465935
20  -0.532442 -0.069650 -0.383597 -0.961882
21   0.117354 -1.126846  1.212175  0.433883
22  -1.324758  1.024052  1.072737  2.271973
23   0.164652 -1.009989 -0.732836 -0.767877
24   1.185607  1.586423  0.292912 -1.112453
25   0.089760  1.763095 -0.543636 -0.475757
26  -0.327015  0.643779 -1.549935  0.430376
27   0.043266  1.427616 -1.090092  0.610822
28   1.231132  1.057774 -1.197623 -0.284723
29  -0.113603 -0.159795  0.588437  0.577711
..        ...       ...       ...       ...
970 -1.842807 -1.059984 -0.872550  0.239257
971 -0.276920  1.126508 -0.673127  0.572947
972  1.144953 -1.027155  0.446058  1.265947
973 -1.195315  2.447449 -1.185167  0.556000
974 -1.200702 -0.609335  1.919485  0.041074
975 -1.137537 -0.644284  0.046679 -0.701219
976  1.122862 -0.923079 -0.001035 -1.180502
977 -1.564739  0.048546 -0.758736 -0.489869
978 -0.352173 -0.168415 -0.515249  2.023484
979 -0.992427 -0.371562  0.773851  0.255303
980  0.555341 -2.306583 -0.462534 -2.053151
981 -0.355544  1.437799 -0.919165  0.094930
982 -0.064190  0.597516  0.241986  1.393088
983 -0.083049  0.420318 -0.579663  0.875891
984 -0.663614  0.105463  0.170071  1.194663
985 -0.569266 -0.228472  1.991103  1.167997
986  0.674803  0.160014  0.047928  0.272884
987 -0.976010  1.615220 -0.756845  1.213991
988  0.219455  0.254843 -0.562383 -1.882159
989 -0.022241  1.169118 -0.159166  0.796189
990 -0.693559  1.534993  0.028896  0.988058
991 -0.734995  0.171579  0.238120  0.831664
992  2.093674  0.651179  0.579191 -1.178520
993 -0.715180  0.225852  0.459279  1.067965
994 -1.028513 -0.921671  0.069873 -0.648651
995 -0.198447  2.117078  0.796608  0.219975
996  0.544353 -0.779939 -0.020859 -2.814454
997 -1.470387 -0.573224  0.302664 -0.241241
998 -0.483212  1.213237 -0.174959 -0.656002
999 -1.938115 -1.390581 -1.085068 -0.922954

[1000 rows x 4 columns]

Now suppose you want to find values in one of the columns exceeding 3 in absolute value:

In [84]:
col = data[2]
col[np.abs(col) > 3]

89     3.892364
136   -3.107624
671    3.056646
765    3.518040
Name: 2, dtype: float64

To select all rows having a value exceeding 3 or -3, you can use the `any` method on a boolean DataFrame

In [85]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
89  -0.181102  1.388486  3.892364 -0.642609
136 -1.157234  0.947447 -3.107624  0.356629
332  0.070986 -1.297971  0.583924  4.134193
606 -0.330076 -3.293787 -2.347882 -0.291574
671 -0.959525 -0.625054  3.056646 -0.096484
738  0.529624 -3.148706 -0.533274 -0.614905
765 -1.314589  0.263851  3.518040  0.841111
954  0.811881  3.180981  0.703731 -0.177595

We can also find if the value in a DataFrame is positive or negative by
`np.sign()` statement.

In [87]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2  1.0 -1.0 -1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

## Permutation and Random Sampling

Permuting means randomly reordering a Sereis orthe rows in a dataframe.
We can use `numpy.random.permutation` function to do that.

In [88]:
df = pd.DataFrame(np.arange(5*4).reshape((5, 4)))

In [91]:
sampler = np.random.permutation(5)

In [92]:
sampler

array([4, 2, 1, 0, 3])

In [93]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [94]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

As we can see that sampler has shuffled the indexes. We used `take` function for the sampler to use.

To generate a sample with replacement (to allow repeat choices), pass `replace=True`

In [95]:
choices = pd.Series([5, 7, -1, 6, 4])

In [96]:
draws = choices.sample(n=10, replace=True)

In [97]:
draws

4    4
3    6
1    7
3    6
2   -1
3    6
0    5
3    6
3    6
0    5
dtype: int64

## Computing Indicator/Dummy Variables

We can convert machine learning application's categorical variables into "dummy" or "indicator" matrix. For doing that we can use `pandas.get_dummies()`function.

In [98]:
df = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1':range(6)})

In [99]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [100]:
pd.get_dummies(df)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [101]:
pd.get_dummies(df['data1'])

   0  1  2  3  4  5
0  1  0  0  0  0  0
1  0  1  0  0  0  0
2  0  0  1  0  0  0
3  0  0  0  1  0  0
4  0  0  0  0  1  0
5  0  0  0  0  0  1

In [102]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

We can also add a prefix to our columns by `prefix` argument or we can simply pass the dataframe to `get_dummies()` function.

In [103]:
dummies_pre = pd.get_dummies(df['key'], prefix='key')

In [104]:
dummies_pre

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

What if in some cases a row in a DataFrame belongs to multiple categories, then things can become more complicated.

In [105]:
mnames = ['movie_id', 'title', 'genres']

In [123]:
movies = pd.read_csv('movies_metadata.csv', low_memory=False)

## String Manipulation

**String Object Methods**

In [129]:
val = 'a,b, gudo'

In [130]:
val.split(',')

['a', 'b', ' gudo']

We can also strip the whitesapces with `strip()` function.

In [131]:
places = [x.strip() for x in val.split(',')]

In [132]:
places

['a', 'b', 'gudo']

We can also use `join(array)` for joining an array with specific string  value.

In [133]:
'::'.join(places)

'a::b::gudo'

In [134]:
'gudo' in val

True

In [135]:
val.index(',')

1

In [136]:
val.find(':')

-1

In [137]:
val.index(':')

ValueError: substring not found

In [138]:
val.count(',')

2

In [139]:
val.replace(',', '::')

'a::b:: gudo'

## Regular Expressions

In [140]:
import re

In [141]:
text = "foo bar\t baz  \tqux"

In [142]:
text

'foo bar\t baz  \tqux'

In [143]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

When we call `re.split('\s+', text)`, the regular expression is first compiled, and then its split method is called on the passed text.

We can also compile regex with ourself with `re.compile`

In [144]:
regex = re.compile('\s+')

In [145]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [146]:
regex.findall(text)

[' ', '\t ', '  \t']

In [147]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [152]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [153]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [154]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [155]:
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [156]:
m = regex.search(text)

In [157]:
m

In [158]:
text[m.start():m.end()]

'dave@google.com'

In [159]:
print(regex.match(text))

None

In [160]:
print(regex.sub('REGA', text))

Dave REGA
Steve REGA
Rob REGA
Ryan REGA

Suppose you wanted to find email addresses and simultaneously segment each address into it's three components: username, domain, and domain suffix. To do this, put parantheses around the parts of the pattern to segment:

In [161]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [162]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [163]:
m = regex.match('gopalsing@gami.com')

In [164]:
m.groups()

('gopalsing', 'gami', 'com')

`findall` returns a list of tuples when the patterns has groups:

In [165]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [166]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectoried String Fucntions in pandas

In [167]:
data = {'Dave':'dave@google.com', 'Steve':'steve@gamil.com', 
       'Rob':'rob@gmail.com', 'Wes':NA}

In [168]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gamil.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [169]:
data = pd.Series(data)

In [170]:
data

Dave     dave@google.com
Steve    steve@gamil.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [171]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [172]:
data.str.contains('gmail')

Dave     False
Steve    False
Rob       True
Wes        NaN
dtype: object

In [173]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [174]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gamil, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [175]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [176]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

## The End (Except that movie data)